from enum import Enum, IntEnum
import random


class Gender(Enum):
    MALE = '男'
    FEMALE = '女'

    @staticmethod
    def random():
        return random.choice(list(Gender))


class Trait(IntEnum):
    APPEARANCE = 0
    PHYSIQUE = 1
    BACKGROUND = 2
    ABILITY = 3
    FAME = 4
    KNOWLEDGE = 5
    STRENGTH = 6
    MORALITY = 7
    BOTTOM_LINE = 8
    KINDNESS = 9
    NATURE = 10
    EXPERIENCE = 11
    TALENT = 12

    @staticmethod
    def random():
        return random.choice(list(Trait))


class Preference(Enum):
    ZITHER = "弹琴"
    CHESS = "下棋"
    BOOK = "读书"
    PAINTING = "画画"

    @staticmethod
    def random():
        return random.choice(list(Preference))


class Behavior(IntEnum):
    SAVE = 0
    HARM = 1
    HARMED = 2


last_names = ['粟', '茹', '冠', '真', '先', '须', '克', '爱', '巫', '芮', '寒', '绿', '钮', '母', '素', '崔', '荣', '汤', '山', '封', '孔', '墨', '沐', '宝', '都', '升', '暴', '魏', '盛', '郜', '巢', '段', '扬', '钱', '秋', '望', '蔚', '窦', '毛', '季', '许', '旷', '紫', '浮', '润', '承', '珠', '科', '天', '厉', '雪', '豆', '北', '名', '宇', '生', '焦', '虎', '麦', '诸', '屠', '明', '邱', '留', '展', '冼', '管', '毕', '耿', '闵', '巴', '安', '南', '冯', '慈', '立', '晏', '鲁', '束', '汝', '刘', '佐', '妙', '况', '多', '塔', '若', '解', '闪', '蔺', '凡', '厚', '雄', '梁', '齐', '辜', '融', '顺', '应', '野', '通', '禹', '拓', '本', '米', '赵', '原', '依', '修', '赖', '彩', '苗', '萧', '沙', '朗', '夏', '雍', '赛', '佳', '刁', '运', '竺', '光', '西', '邰', '向', '扶', '问', '朱', '如', '别', '皮', '德', '旺', '布', '奚', '佘', '尤', '渠', '李', '力', '周', '松', '杰', '元', '孟', '卜', '华', '房', '行', '雷', '赤', '陈', '海', '库', '郑', '雅', '威', '奎', '正', '万', '牧', '潭', '俞', '湘', '滑', '才', '荷', '可', '包', '福', '刑', '潮', '孝', '乃', '朝', '池', '宜', '龙', '京', '阳', '汉', '邹', '董', '自', '书', '扈', '来', '富', '沃', '芦', '鄢', '经', '亓', '孙', '励', '晋', '柏', '年', '种', '由', '勒', '开', '法', '杜', '粱', '剑', '门', '能', '邝', '姜', '丘', '斯', '绍', '回', '翠', '田', '岩', '满']
female_names = ['慧新', '汗', '汉彬', '建涛', '李松', '浩博', '晓阳', '鲁', '协志', '靖天', '为江', '罗忠', '伯昕', '秋元', '子钦', '煜惠', '之桦', '汉星', '朝福', '贻汾', '非亚', '鸿运', '耀午', '生龙', '梓桐', '景', '建焘', '明如', '晓闻', '于慧', '勇奎', '芳汶', '燮龙', '悦霖', '俊培', '灵辉', '均利', '道芳', '恒年', '文战', '劲帆', '厅', '化仁', '素方', '结军', '乃旭', '木森', '烈建', '丽芝', '颂武', '斌煊', '学万', '飞亚', '碧玲', '收', '淑健', '贻兵', '红蓝', '万莉', '明光', '道法', '耀祖', '铁崖', '叔阳', '运强', '茜娜', '亭雅', '镇才', '荣锦', '学岭', '杨桂', '赞伟', '景枫', '英侠', '敏文', '吾', '媛兰', '丽兴', '琼霞', '巨利', '爱芝', '潇龙', '宇娓', '聪燕', '尚屹', '声震', '尚飞', '建选', '秀琳', '长盛', '国记', '可兰', '琦玉', '庆泊', '来梵', '立标', '义明', '怡珊', '驰新', '欢岳', '木仁', '子贞', '雯瑶', '双正', '丽永', '红冉', '颜章', '汉潮', '辰恺', '秋如', '江鸣', '佳兰', '表山', '羽欣', '肖海', '海仙', '荣政', '淑仪', '必香', '二娣', '高登', '益格', '德沂', '学福', '保根', '水敏', '芝泉', '俊曾', '承煜', '昌奎', '汇祥', '启林', '仙鹤', '逸平', '继先', '维彪', '久来', '素飞', '傲嘉', '明昕', '博凯', '先泉', '路璐', '江凤', '培育', '冰梅', '合强', '效玉', '其飞', '语熙', '尚金', '思进', '海蓬', '闻潮', '学城', '茂涛', '靖中', '仁陆', '成亮', '学枫', '衍伟', '者聪', '见兴', '建鹏', '传昌', '增喜', '瑞令', '利庆', '富路', '振瑞', '江珊', '佐贵', '俊新', '邦吉', '建慈', '林朝', '信孝', '介刚', '水淼', '奕钦', '艺霏', '浩章', '以臣', '继英', '中志', '怀锋', '顺朝', '香东', '化', '京华', '韵如', '薰华', '丽妍', '武荣', '秋粉', '明哲', '以柔', '善雨', '忠兴', '先钧', '能敏', '俊坡', '永之', '易正', '忠安', '桂莉', '晞临', '勋波', '伍林', '红心', '若峰', '桂霖', '坤铭', '士谦', '坤云', '文俞', '世球', '项城', '郁明', '叶伟', '忠晏', '继洲', '泓鑫', '喜来', '韶旭', '慕菊', '斯良', '马旭', '思禹', '定宗', '高英', '爱达', '廷翠', '宁哲', '成利', '起飞', '国任', '赵嫔', '依卿', '颖仪', '红念', '青卓', '承静', '屹鸥', '佳彤', '科学', '渤海', '洪兴', '进喜', '自鑫', '佳月', '伦策', '心忠', '文绪', '纯信', '周斌', '卫闽', '益剑', '佳培', '绍星', '安年', '依蕾', '治策', '恒青', '文营', '若嘉', '得春', '颖燕', '瀛婷', '君蓉', '维淳', '丽吉', '卫学', '子乐', '勤生', '仁浩', '宏良', '文法', '赤卫', '常顺', '康明', '五华', '相贤', '丽岩', '洁静', '付静', '伟娥', '有堂', '启路', '殿金', '复彩', '杰元', '忠焕', '鸿英', '千翔', '自坚', '代松', '位东', '继前', '惠贞', '冬娜', '道益', '俊岚', '李飞', '丛铭', '宗维', '粲', '培玲', '兴武', '令婷', '九鹏', '奕宁', '浩鹏', '纳', '肖艳', '善君', '欢军', '介飞', '双磊', '浜', '贤春', '孝桂', '会通', '志胤', '吉清', '丙国', '苏娥', '富琳', '悦宁', '滨华', '淼艳', '元朋', '凤娜', '土苗', '友昆', '月照', '书民', '中求', '孟宜', '晃林', '朝夫', '朵丽', '云柱', '汝芝', '飞阳', '刘胜', '嘉丰', '祥萍', '如秋', '君星', '基宏', '益志', '际东', '作峻', '尔平', '萍生', '乃岩', '雨南', '承祚', '凯洪', '广林', '延超', '盛奎', '念宇', '钦典', '冰雅', '泽城', '春发', '君玫', '懿群', '雨欣', '信如', '世魁', '庆瑞', '敏月', '梅岗', '新士', '彦哲', '洪怀', '厚江', '里雅', '井华', '武和', '若邻', '庭芳', '心磊', '威硕', '民泉', '业亮', '海仁', '公乐', '公林', '义鸿', '林木', '召彬', '承颖', '香弟', '雅帆', '增千', '婷棋', '伯耀', '进仁', '悦珏', '建进', '述清', '同会', '日茂', '楚芳', '青川', '楚楚', '得坡', '博清', '百草', '尽昭', '富锦', '昆仑', '钰泽', '培升', '海吉', '木青', '学义', '博卫', '树法', '选珠', '献勇', '俊才', '均宇', '荣魁', '礼洪', '永茹', '瑜瑶', '龙凯', '孝忠', '铭慈', '乐群', '桥', '湘彬', '正标', '理伦', '放毅', '苏联', '山民', '健章', '常风', '光冲', '延照', '树为', '吉才', '名启', '源鹏', '玄哲', '洪洲', '新为', '仕霞', '长付', '自阳', '仲银', '周翰', '元懿', '莲福', '甲胜', '祖珍', '怡凯', '妙卿', '佐良', '有中', '游龙', '钧美', '葵红', '天越', '汉黎', '嵩涛', '金庄', '香荣', '碧欣', '宗绍', '馨茜', '光基', '培双', '婷瑜', '忠圣', '强山', '恩思', '智彤', '传义', '凤海', '致美', '益磊', '冬强', '钰怡', '凤卿', '泓博', '洪民', '升田', '桂通', '文扬', '大娃', '文炳', '承修', '细红', '承铎', '卓成', '海柯', '庭利', '世仑', '焱文', '荣健', '展奋', '洪汉', '宪刚', '大筠', '关秀', '尔贤', '阳涛', '宗容', '承鲁', '肖宁', '思莹', '纯赛', '元继', '坚钢', '越人', '序常', '根良', '葆明', '秀朵', '治藩', '廷重', '任军', '德嘉', '玲玲', '一晖', '玉恩', '宇汉', '植仪', '曲吟', '浩儒', '科维', '毓静', '繁武', '昱和', '雨丽', '宋', '亦菲']
male_names = ['治藩', '述清', '明哲', '丙国', '汉潮', '世仑', '杨桂', '正标', '纯赛', '浜', '屹鸥', '赞伟', '山民', '钰泽', '道益', '耀祖', '荣锦', '继洲', '彦哲', '学岭', '均宇', '宁哲', '理伦', '飞阳', '伯昕', '忠兴', '展奋', '吾', '辰恺', '建涛', '贻汾', '伍林', '嵩涛', '任军', '来梵', '仲银', '薰华', '保根', '土苗', '木森', '科学', '志胤', '凤海', '海仁', '铁崖', '民泉', '健章', '均利', '信如', '奕宁', '业亮', '际东', '云柱', '游龙', '厚江', '京华', '尔贤', '玉恩', '叶伟', '杰元', '忠安', '子乐', '兴武', '景枫', '结军', '收', '晃林', '常顺', '晓阳', '立标', '顺朝', '朝夫', '贤春', '洪洲', '培育', '繁武', '敏文', '能敏', '心忠', '其飞', '中求', '浩鹏', '起飞', '坚钢', '君星', '尽昭', '荣健', '升田', '长盛', '自鑫', '天越', '益磊', '斯良', '常风', '项城', '梓桐', '学福', '洪兴', '尚飞', '维彪', '冬强', '宗维', '序常', '会通', '建选', '勤生', '俊培', '叔阳', '文绪', '浩博', '同会', '甲胜', '若邻', '名启', '强山', '耀午', '庆泊', '恒年', '义鸿', '广林', '焱文', '奕钦', '丛铭', '增喜', '萍生', '元懿', '青卓', '吉才', '汇祥', '学义', '葆明', '献勇', '汗', '见兴', '刘胜', '增千', '义明', '颂武', '铭慈', '建进', '念宇', '培双', '郁明', '悦霖', '思禹', '瑞令', '双磊', '文战', '赤卫', '得春', '善雨', '博卫', '钦典', '博清', '日茂', '驰新', '生龙', '吉清', '承煜', '洪怀', '益志', '千翔', '李飞', '表山', '介飞', '文俞', '汉黎', '文法', '粲', '靖中', '林朝', '宋', '孝桂', '益剑', '嘉丰', '如秋', '康明', '根良', '为江', '井华', '卫学', '召彬', '周斌', '书民', '海吉', '易正', '若峰', '坤云', '世魁', '启路', '怡凯', '建鹏', '庭利', '传义', '海柯', '鲁', '继先', '先钧', '忠圣', '士谦', '永之', '智彤', '怀锋', '继前', '公乐', '洪民', '富路', '进喜', '朝福', '恒青', '坤铭', '巨利', '之桦', '子钦', '善君', '道法', '渤海', '光冲', '殿金', '卫闽', '武和', '佐良', '一晖', '越人', '昆仑', '鸿运', '明光', '乃岩', '威硕', '文炳', '青川', '秋元', '宪刚', '烈建', '欢军', '化', '合强', '荣政', '龙凯', '靖天', '衍伟', '周翰', '双正', '振瑞', '宇汉', '贻兵', '洪汉', '明昕', '香东', '喜来', '基宏', '佐贵', '逸平', '燮龙', '绍星', '泽城', '利庆', '科维', '浩章', '百草', '汉彬', '文营', '金庄', '德嘉', '学枫', '相贤', '治策', '得坡', '代松', '庆瑞', '尚金', '爱达', '树为', '仁陆', '莲福', '植仪', '闻潮', '培升', '芝泉', '飞亚', '晞临', '孝忠', '丽兴', '成亮', '成利', '久来', '江鸣', '廷重', '纯信', '梅岗', '仁浩', '世球', '尔平', '海蓬', '邦吉', '泓鑫', '国记', '安年', '勇奎', '荣魁', '自阳', '春发', '木仁', '元朋', '浩儒', '文扬', '俊才', '声震', '新士', '信孝', '伯耀', '盛奎', '者聪', '纳', '晓闻', '建焘', '高登', '有堂', '李松', '玄哲', '乃旭', '潇龙', '元继', '木青', '复彩', '宗绍', '礼洪', '树法', '凯洪', '林木', '欢岳', '源鹏', '九鹏', '光基', '乐群', '长付', '位东', '阳涛', '学万', '有中', '明如', '滨华', '汉星', '恩思', '运强', '维淳', '大筠', '伦策', '学城', '水淼', '公林', '厅', '景', '中志', '思进', '桥', '忠晏', '介刚', '德沂', '罗忠', '马旭', '友昆', '国任', '延照', '心磊', '作峻', '卓成', '定宗', '承祚', '承铎', '延超', '桂通', '化仁', '进仁', '传昌', '峰厚', '肖海', '尚屹', '昌奎', '斌煊', '俊新', '泓博', '大娃', '韶旭', '昱和', '以臣', '月照', '启林', '益格', '武荣', '灵辉', '颜章', '协志', '勋波', '先泉', '富锦', '俊坡']


class Job(Enum):
    NONE = "无业"
    TEACHER = "私塾先生"
    MANAGER = "掌柜"
    EMPLOYEE = "店铺伙计"
    POLITICAL = "朝廷官员"
    FARMER = "农名"
    STRUCTURE = "工匠"
    MERCHANT = "商人"
    BEGGAR = "乞丐"
    SOLDIER = "士兵"
    WAITRESS = "丫鬟"
    WAITER = "小厮"

    @staticmethod
    def random():
        return random.choice(list(Job))


class MerchantType(Enum):
    RESTAURANT = "酒楼"
    MATCH_MAKER = "姻缘阁"
    BANK = "钱庄"
    SCHOOL = "私塾"
    SMITHY = "铁匠铺"
    SILK_SHOP = "绸缎庄"
    BROTHEL = "醉芳阁"
    OFFICE = "衙门"
    pass


class EventType(Enum):
    POSITIVE_SUM = "正和博弈"
    ZERO_SUM = "零和博弈"
    NEGATIVE_SUM = "负和博弈"
    PRISONER = "囚徒困境"
    RESCUE = "危机事件"

    @staticmethod
    def random():
        return random.choice(list(EventType))


class Month(IntEnum):
    DEC = 0
    JAN = 1
    FEB = 2
    MAR = 3
    APR = 4
    MAY = 5
    JUN = 6
    JUL = 7
    AUG = 8
    SEP = 9
    OCT = 10
    NOV = 11


class Period(Enum):
    FIRST = "上旬"
    SECOND = "中旬"
    THIRD = "下旬"
